; domain
(define (domain minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :conditional-effects :existential-preconditions :constraints :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   empty - empty_0
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (increase (total-cost) 1)))
)

; problem
(define (problem minigrid-problem)
 (:domain minigrid-domain)
 (:objects
   room_1 room_2 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   blue_door_1 red_door_1 purple_door_1 blue_door_2 - door
   yellow_ball_1 grey_ball_2 grey_ball_3 grey_ball_1 green_ball_1 - ball
   red_box_1 yellow_box_1 green_box_1 - box
 )
 (:init (agentinroom room_1) (objectinroom red_box_1 room_1) (objectinroom yellow_box_1 room_1) (objectinroom grey_ball_1 room_2) (objectinroom grey_ball_2 room_2) (objectinroom grey_ball_3 room_3) (objectinroom green_box_1 room_4) (objectinroom yellow_ball_1 room_4) (objectinroom green_ball_1 room_4) (objectcolor red_box_1 redtype) (objectcolor yellow_box_1 yellowtype) (objectcolor grey_ball_1 greytype) (objectcolor grey_ball_2 greytype) (objectcolor grey_ball_3 greytype) (objectcolor green_box_1 greentype) (objectcolor yellow_ball_1 yellowtype) (objectcolor green_ball_1 greentype) (objectcolor blue_door_1 bluetype) (objectcolor red_door_1 redtype) (objectcolor purple_door_1 purpletype) (objectcolor blue_door_2 bluetype) (emptyhands) (locked blue_door_1) (locked red_door_1) (locked purple_door_1) (locked blue_door_2) (adjacentrooms room_2 room_1 blue_door_1) (adjacentrooms room_1 room_2 blue_door_1) (adjacentrooms room_3 room_1 red_door_1) (adjacentrooms room_1 room_3 red_door_1) (adjacentrooms room_4 room_2 purple_door_1) (adjacentrooms room_2 room_4 purple_door_1) (adjacentrooms room_4 room_3 blue_door_2) (adjacentrooms room_3 room_4 blue_door_2) (visited room_1) (= (total-cost) 0))
 (:goal (and (exists (?v - ball)
 (and (objectcolor ?v greytype) (objectinroom ?v room_2) (agentinroom room_2) (at_ ?v)))))
 (:constraints (sometime (at_ yellow_box_1)) (sometime (at_ blue_door_1)) (sometime-before (at_ blue_door_1) (carrying grey_ball_3)) (sometime (locked blue_door_1)) (sometime-after (locked blue_door_1) (or (agentinroom room_4) (not (emptyhands)))) (sometime (carrying red_box_1)) (sometime (not (locked blue_door_1))) (sometime-before (not (locked blue_door_1)) (carrying yellow_ball_1)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor red_door_1 room_1 room_3)
   added: (at_ red_door_1)
   goals met: 0 of 1
2. (toggle red_door_1)
   deleted: (locked red_door_1)
   goals met: 0 of 1
3. (gotoobject red_box_1 room_1)
   deleted: (at_ red_door_1)
   added: (at_ red_box_1)
   goals met: 0 of 1
4. (pick red_box_1 room_1)
   deleted: (at_ red_box_1) (emptyhands) (objectinroom red_box_1 room_1)
   added: (carrying red_box_1)
   goals met: 0 of 1
5. (gotoobject yellow_box_1 room_1)
   added: (at_ yellow_box_1)
   goals met: 0 of 1
6. (gotoroom room_1 room_3 red_door_1)
   deleted: (agentinroom room_1) (at_ yellow_box_1)
   added: (agentinroom room_3) (visited room_3)
   goals met: 0 of 1
7. (gotodoor blue_door_2 room_3 room_4)
   added: (at_ blue_door_2)
   goals met: 0 of 1
8. (toggle blue_door_2)
   deleted: (locked blue_door_2)
   goals met: 0 of 1
9. (gotoempty)
   deleted: (at_ blue_door_2)
   added: (at_ empty)
   goals met: 0 of 1
10. (drop red_box_1 room_3)
   deleted: (carrying red_box_1) (at_ empty)
   added: (at_ red_box_1) (emptyhands) (objectinroom red_box_1 room_3)
   goals met: 0 of 1
11. (gotoobject grey_ball_3 room_3)
   deleted: (at_ red_box_1)
   added: (at_ grey_ball_3)
   goals met: 0 of 1
12. (pick grey_ball_3 room_3)
   deleted: (at_ grey_ball_3) (emptyhands) (objectinroom grey_ball_3 room_3)
   added: (carrying grey_ball_3)
   goals met: 0 of 1
13. (gotoroom room_3 room_4 blue_door_2)
   deleted: (agentinroom room_3)
   added: (agentinroom room_4) (visited room_4)
   goals met: 0 of 1
14. (gotodoor purple_door_1 room_4 room_2)
   added: (at_ purple_door_1)
   goals met: 0 of 1
15. (toggle purple_door_1)
   deleted: (locked purple_door_1)
   goals met: 0 of 1
16. (gotoempty)
   deleted: (at_ purple_door_1)
   added: (at_ empty)
   goals met: 0 of 1
17. (drop grey_ball_3 room_4)
   deleted: (carrying grey_ball_3) (at_ empty)
   added: (at_ grey_ball_3) (emptyhands) (objectinroom grey_ball_3 room_4)
   goals met: 0 of 1
18. (gotoobject yellow_ball_1 room_4)
   deleted: (at_ grey_ball_3)
   added: (at_ yellow_ball_1)
   goals met: 0 of 1
19. (pick yellow_ball_1 room_4)
   deleted: (at_ yellow_ball_1) (emptyhands) (objectinroom yellow_ball_1 room_4)
   added: (carrying yellow_ball_1)
   goals met: 0 of 1
20. (gotoroom room_4 room_2 purple_door_1)
   deleted: (agentinroom room_4)
   added: (agentinroom room_2) (visited room_2)
   goals met: 0 of 1
21. (gotodoor blue_door_1 room_2 room_1)
   added: (at_ blue_door_1)
   goals met: 0 of 1
22. (toggle blue_door_1)
   deleted: (locked blue_door_1)
   goals met: 0 of 1
23. (gotoobject grey_ball_1 room_2)
   deleted: (at_ blue_door_1)
   added: (at_ grey_ball_1)
   goals met: 1 of 1
